Infineon/mtb-example-psoc4-msclp-lls/main.c
/******************************************************************************
 * File Name: main.c
 *
 * Description: This is the source code for the PSoC 4 MSCLP CAPSENSE™ liquid level sensing code example for ModusToolbox.
 *
 * Related Document: See README.md
 *
 *******************************************************************************
 * Copyright 2021-2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 *******************************************************************************/

/*******************************************************************************
 * Include header files
 ******************************************************************************/
#include "cy_pdl.h"
#include "cybsp.h"
#include "cycfg.h"
#include "cycfg_capsense.h"
#include "cy_em_eeprom.h"
#include <stdint.h>
/*******************************************************************************
 * User configurable Macros
 ********************************************************************************/
#define STATE_VALID                     (1u)
#define CYBSP_LED_OFF                   (0u)
#define CYBSP_LED_ON                    (1u)

/*******************************************************************************
 * One time factory CDAC calibration Macros
 ********************************************************************************/

/* It is mandatory to perform one time factory CDAC calibration for liquid level widgets on each devices. 
 * Using this macro "LLS_FACTORY_CALIBRATION_ENABLE" helps to identify the relevant source code involved in
 * enabling this emulated EERPROM based one time factory calibration.
 * Not recommended to disable this macro. 
 */
#define LLS_FACTORY_CALIBRATION_ENABLE     (1u) // Don't set this to 0

#if LLS_FACTORY_CALIBRATION_ENABLE

/* ASCII "P" */
#define ASCII_P                     (0x50)

#define POWERON_STATE_OFFSET        (0u)
#define POWERON_STATUS_SIZE         (1u)

#define WD_CDAC_PARMS_SIZE              (1u+ 1u +1u +2u ) // Status+CRef+CFine+CComp_div
#define TOTAL_WD_CDAC_PARMS_SIZE        (CY_CAPSENSE_TOTAL_WIDGET_COUNT * WD_CDAC_PARMS_SIZE)
#define SNS_CDAC_PARMS_SIZE             (CY_CAPSENSE_SENSOR_COUNT * 1u) // CComp
#define TOTAL_CDAC_PARMS_SIZE           (TOTAL_WD_CDAC_PARMS_SIZE + SNS_CDAC_PARMS_SIZE)

#define EEPROM_STATE_OFFSET         (0u)
#define EEPROM_DATA_OFFSET          (1u)
/*Enable PWM controlled LEDs*/
#define ENABLE_PWM_LED                  (1u) 

#if ENABLE_PWM_LED
#define PWM_FREQ                        (7812u)

/* --- Liquid Level Blink Rates (Adjust these HZ values as needed) --- */
/* Level 1: Slowest  */
#define LEVEL_1_BLINK_RATE_IN_HZ    (1u)
/* Level 2: Medium  */
#define LEVEL_2_BLINK_RATE_IN_HZ    (2u)
/* Level 3: Fastest  */
#define LEVEL_3_BLINK_RATE_IN_HZ    (10u)

#define LEVEL_1_BLINK_PERIOD        ((uint32_t)(PWM_FREQ / LEVEL_1_BLINK_RATE_IN_HZ))
#define LEVEL_2_BLINK_PERIOD        ((uint32_t)(PWM_FREQ / LEVEL_2_BLINK_RATE_IN_HZ))
#define LEVEL_3_BLINK_PERIOD        ((uint32_t)(PWM_FREQ / LEVEL_3_BLINK_RATE_IN_HZ))
#define LEVEL_1_DUTY_CYCLE          ((LEVEL_1_BLINK_PERIOD) >> 1u)
#define LEVEL_2_DUTY_CYCLE          ((LEVEL_2_BLINK_PERIOD) >> 1u)
#define LEVEL_3_DUTY_CYCLE          ((LEVEL_3_BLINK_PERIOD) >> 1u)

#endif /* ENABLE_PWM_LED */

/*******************************************************************************
 * EMULATED EEPROM configuration parameters
 ********************************************************************************/
/* Emulated EEPROM Configuration details. All the sizes mentioned are in bytes.
 * For details on how to configure these values refer to cy_em_eeprom.h. The
 * middleware documentation is provided in Emulated EEPROM API Reference Manual.
 * The user can access it from the Documentation section in the Quick Panel.
 */

/* Logical Size of Emulated EEPROM in bytes */
#define LOGICAL_EM_EEPROM_SIZE      POWERON_STATUS_SIZE + TOTAL_CDAC_PARMS_SIZE
#define LOGICAL_EM_EEPROM_START     (0u)

#define EM_EEPROM_SIZE   ((TOTAL_CDAC_PARMS_SIZE % CY_EM_EEPROM_FLASH_SIZEOF_ROW) ? ((TOTAL_CDAC_PARMS_SIZE / CY_EM_EEPROM_FLASH_SIZEOF_ROW) + 1) * CY_EM_EEPROM_FLASH_SIZEOF_ROW  : (TOTAL_CDAC_PARMS_SIZE / CY_EM_EEPROM_FLASH_SIZEOF_ROW) *  CY_EM_EEPROM_FLASH_SIZEOF_ROW)

