Infineon/mtb-example-psoc4-msclp-lls/main.c
/*If enabled (1 - enabled, 0 - disabled), a checksum (stored in a row) is calculated on each row of data,
 * while a redundant copy of Em_EEPROM is stored in another location.
 * When data is read, first the checksum is checked. If that checksum is bad,
 and the redundant copy's checksum is good, the copy is restored.
 */
#define REDUNDANT_COPY              (1u)

/*If enabled (1 - enabled, 0 - disabled), the blocking writes to nvm are used in the design.
 * Otherwise, non-blocking nvm writes are used. From the user's perspective,
 * the behavior of blocking and non-blocking writes are the same - the difference is that
 * the non-blocking writes do not block the interrupts.
 Note
 Non-blocking nvm write is only supported by PSoC 6.
 */
#define BLOCKING_WRITE              (1u)

/*The higher the factor is, the more nvm is used, but a higher number of erase/write cycles can be done on Em_EEPROM.
 * Multiply this number by the datasheet write endurance spec to determine the max of write cycles.
 * The amount of wear leveling from 1 to 10. 1 means no wear leveling is used.
 */
#define WEAR_LEVELLING_FACTOR       (2u)

/*Simple mode, when enabled (1 - enabled, 0 - disabled),
 * means no additional service information is stored by the Em_EEPROM middleware
 * like checksums, headers, a number of writes, etc.
 */
#define SIMPLE_MODE                 (0u)

#define EM_EEPROM_PHYSICAL_SIZE     (CY_EM_EEPROM_GET_PHYSICAL_SIZE(EM_EEPROM_SIZE, SIMPLE_MODE, WEAR_LEVELLING_FACTOR, REDUNDANT_COPY))

#endif

/*******************************************************************************
 * Fixed Macros
 *******************************************************************************/
#define CAPSENSE_MSC0_INTR_PRIORITY     (3u)
#define CY_ASSERT_FAILED                (0u)

/* EZI2C interrupt priority must be higher than CAPSENSE&trade; interrupt. */
#define EZI2C_INTR_PRIORITY             (2u)

/*******************************************************************************
 * Global Variables
 *******************************************************************************/
cy_stc_scb_ezi2c_context_t ezi2c_context;

#if LLS_FACTORY_CALIBRATION_ENABLE

cy_stc_eeprom_context_t em_eeprom_context;

static cy_stc_eeprom_config_t em_eeprom_config = { .eepromSize = EM_EEPROM_SIZE, /* 256 bytes */
        .blockingWrite = BLOCKING_WRITE, /* Blocking writes enabled */
        .redundantCopy = REDUNDANT_COPY, /* Redundant copy enabled */
        .wearLevelingFactor = WEAR_LEVELLING_FACTOR, /* Wear levelling factor of 2 */
        .simpleMode = SIMPLE_MODE, /* Simple mode disabled */
};

/* EEPROM storage Emulated EEPROM flash. */
CY_ALIGN( CY_EM_EEPROM_FLASH_SIZEOF_ROW)
const uint8_t em_eeprom_storage[EM_EEPROM_PHYSICAL_SIZE] = { 0u };

/* RAM arrays for holding Emulated EEPROM read and write data respectively. */
uint8_t eeprom_data[LOGICAL_EM_EEPROM_SIZE];

#endif

/*******************************************************************************
 * Function Prototypes
 *******************************************************************************/
static void initialize_capsense(void);
static void capsense_msc0_isr(void);
static void ezi2c_isr(void);
static void initialize_capsense_tuner(void);
void led_control();

#if LLS_FACTORY_CALIBRATION_ENABLE
static void initialize_em_eeprom(void);
static uint32_t get_eeprom_buffer_position(uint32_t wd_id);
static void liquid_level_OneTime_Calibration(void);
#endif

/*******************************************************************************
 * Function Name: main
 ********************************************************************************
 * Summary:
 *  System entrance point. This function performs
 *  - initial setup of device
 *  - initialize CAPSENSE
 *  - initialize tuner communication
 *  - scan liquid level sensor and the liquid level foam rejection sensor continuously
 *  - send the processed sensor data to the tuner
 *
 * Return:
 *  int
 *
 *******************************************************************************/

int main(void)
{
        cy_rslt_t result;

        /* Initialize the device and board peripherals */
        result = cybsp_init();

        /* Board init failed. Stop program execution */
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(CY_ASSERT_FAILED);
    }

    /* Enable global interrupts */
    __enable_irq();

#if LLS_FACTORY_CALIBRATION_ENABLE
    initialize_em_eeprom();
#endif

    /* Initialize EZI2C */
    initialize_capsense_tuner();

    #if ENABLE_PWM_LED
    /* Initialize PWM block */
    (void)Cy_TCPWM_PWM_Init(CYBSP_PWM_HW, CYBSP_PWM_NUM, &CYBSP_PWM_config);
    /* Enable the initialized PWM */
    Cy_TCPWM_Enable_Multiple(CYBSP_PWM_HW, CYBSP_PWM_MASK);
    /* Then start the PWM */
    Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_HW, CYBSP_PWM_MASK);

/*    Cy_TCPWM_PWM_SetPeriod0(CYBSP_PWM_HW, CYBSP_PWM_NUM,390);
    Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_HW, CYBSP_PWM_NUM,195);*/
    #endif

    /* Initialize MSC CAPSENSE */
    initialize_capsense();

    for (;;)
    {
       volatile uint16_t level_w_FD, level_wo_FD;

                /* Scan the normal Liquid Level Widget */
        Cy_CapSense_ScanWidget(CY_CAPSENSE_LIQUIDLEVEL0_WDGT_ID,
                &cy_capsense_context);
        /* Wait until the scan is finished */
        while (Cy_CapSense_IsBusy(&cy_capsense_context))
        {
        }

        /* Scan the Foam Rejection Widget */
        Cy_CapSense_ScanWidget(CY_CAPSENSE_LIQUIDLEVEL0_FD_WDGT_ID,
                &cy_capsense_context);
        /* Wait until the scan is finished */
        while (Cy_CapSense_IsBusy(&cy_capsense_context))
        {
        }

        /* Process all th widgets */
        Cy_CapSense_ProcessAllWidgets(&cy_capsense_context);

        /* Send capsense data to the Tuner */
        Cy_CapSense_RunTuner(&cy_capsense_context);

        /* store the liquid level before and after foam rejection */
        level_wo_FD = Cy_CapSense_GetLiquidWidgetPosition(CY_CAPSENSE_LIQUIDLEVEL0_WDGT_ID,&cy_capsense_context);
        level_w_FD=Cy_CapSense_GetFoamWidgetPosition(CY_CAPSENSE_LIQUIDLEVEL0_FD_WDGT_ID ,&cy_capsense_context);

        (void) level_wo_FD;
        (void) level_w_FD;


        led_control();
    }
}

