Infineon/mtb-example-psoc4-msclp-lls/main.c
/*******************************************************************************
 * Function Name: initialize_capsense
 ********************************************************************************
 * Summary:
 *  This function initializes the CAPSENSE and configures the CAPSENSE
 *  interrupt.
 *
 *******************************************************************************/
static void initialize_capsense(void)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;

    /* CAPSENSE interrupt configuration MSCLP 0 */
    const cy_stc_sysint_t capsense_msc0_interrupt_config = { .intrSrc =
            CY_MSCLP0_LP_IRQ, .intrPriority = CAPSENSE_MSC0_INTR_PRIORITY, };

    /* Capture the MSC HW block and initialize it to the default state. */
    status = Cy_CapSense_Init(&cy_capsense_context);

    if (CY_CAPSENSE_STATUS_SUCCESS == status)
    {
        /* Initialize CAPSENSE interrupt for MSCLP 0 */
        Cy_SysInt_Init(&capsense_msc0_interrupt_config, capsense_msc0_isr);
        NVIC_ClearPendingIRQ(capsense_msc0_interrupt_config.intrSrc);
        NVIC_EnableIRQ(capsense_msc0_interrupt_config.intrSrc);

#if LLS_FACTORY_CALIBRATION_ENABLE
        /* Verify the EEPROM and perform one time factory calibration*/
        liquid_level_OneTime_Calibration();
#endif
        /* Initialize the CAPSENSE firmware modules. */
        status = Cy_CapSense_Enable(&cy_capsense_context);

    }

    if (status != CY_CAPSENSE_STATUS_SUCCESS)
    {
        /* This status could fail before tuning the sensors correctly.
         * Ensure that this function passes after the CAPSENSE sensors are tuned
         * as per procedure give in the Readme.md file */
    }
}

/*******************************************************************************
 * Function Name: capsense_msc0_isr
 ********************************************************************************
 * Summary:
 *  Wrapper function for handling interrupts from CAPSENSE MSC0 block.
 *
 *******************************************************************************/
static void capsense_msc0_isr(void)
{
    Cy_CapSense_InterruptHandler(CY_MSCLP0_HW, &cy_capsense_context);
}

/*******************************************************************************
 * Function Name: initialize_capsense_tuner
 ********************************************************************************
 * Summary:
 * EZI2C module to communicate with the CAPSENSE Tuner tool.
 *
 *******************************************************************************/
static void initialize_capsense_tuner(void)
{
    cy_en_scb_ezi2c_status_t status = CY_SCB_EZI2C_SUCCESS;

    /* EZI2C interrupt configuration structure */
    const cy_stc_sysint_t ezi2c_intr_config = { .intrSrc = CYBSP_EZI2C_IRQ,
            .intrPriority = EZI2C_INTR_PRIORITY, };

    /* Initialize the EzI2C firmware module */
    status = Cy_SCB_EZI2C_Init(CYBSP_EZI2C_HW, &CYBSP_EZI2C_config,
            &ezi2c_context);
    if (status != CY_SCB_EZI2C_SUCCESS)
    {
        CY_ASSERT(CY_ASSERT_FAILED);
    }
    Cy_SysInt_Init(&ezi2c_intr_config, ezi2c_isr);
    NVIC_EnableIRQ(ezi2c_intr_config.intrSrc);

    /* Set the CAPSENSE data structure as the I2C buffer to be exposed to the
     * master on primary slave address interface. Any I2C host tools such as
     * the Tuner or the Bridge Control Panel can read this buffer but you can
     * connect only one tool at a time.
     */
    Cy_SCB_EZI2C_SetBuffer1(CYBSP_EZI2C_HW, (uint8_t*) &cy_capsense_tuner,
            sizeof(cy_capsense_tuner), sizeof(cy_capsense_tuner),
            &ezi2c_context);

    Cy_SCB_EZI2C_Enable(CYBSP_EZI2C_HW);
}

/*******************************************************************************
 * Function Name: ezi2c_isr
 ********************************************************************************
 * Summary:
 * Wrapper function for handling interrupts from EZI2C block.
 *
 *******************************************************************************/
static void ezi2c_isr(void)
{
    Cy_SCB_EZI2C_Interrupt(CYBSP_EZI2C_HW, &ezi2c_context);
}

#if LLS_FACTORY_CALIBRATION_ENABLE

/*******************************************************************************
 * Function Name: initialize_em_eeprom
 ********************************************************************************
 * Summary:
 * Initializes the emulated EEPROM to store the ne time factory calibrated values 
 * and verified the first power on condition 
 *
 *******************************************************************************/
static void initialize_em_eeprom(void)
{
    cy_en_em_eeprom_status_t em_eeprom_status;

    /* Initialize the flash start address in Emulated EEPROM configuration structure*/
    em_eeprom_config.userFlashStartAddr = (uint32_t) em_eeprom_storage;

    /* Initialize Emulated EEPROM */
    em_eeprom_status = Cy_Em_EEPROM_Init(&em_eeprom_config, &em_eeprom_context);

    /* Read the factory calibrated values from EEPROM*/
    Cy_Em_EEPROM_Read(LOGICAL_EM_EEPROM_START, eeprom_data,
            LOGICAL_EM_EEPROM_SIZE, &em_eeprom_context);

    // Verify for the first power on condition
    if (ASCII_P != eeprom_data[POWERON_STATE_OFFSET])
    {
        /* Erase Emulated EEPROM */
        em_eeprom_status = Cy_Em_EEPROM_Erase(&em_eeprom_context);
        eeprom_data[POWERON_STATE_OFFSET] = 'P';
        /* Write the factory calibrated values to EEPROM*/
        Cy_Em_EEPROM_Write(LOGICAL_EM_EEPROM_START, eeprom_data,
                POWERON_STATUS_SIZE, &em_eeprom_context);
    }

    /* Emulated EEPROM init failed. Stop program execution */
    if (em_eeprom_status != CY_EM_EEPROM_SUCCESS)
    {
        CY_ASSERT(CY_ASSERT_FAILED);
    }
}
#endif

#if LLS_FACTORY_CALIBRATION_ENABLE

/*******************************************************************************
 * Function Name: get_eeprom_buffer_position
 ********************************************************************************
 * Summary:
 * Returns the EEPROM pointer location of the widget
 *
 *******************************************************************************/
static uint32_t get_eeprom_buffer_position(uint32_t wd_id)
{
    uint32_t wd_index;
    uint32_t buffer_index = 0;

    for (wd_index = 0u; wd_index < wd_id; wd_index++)
    {
        buffer_index += (WD_CDAC_PARMS_SIZE
                + cy_capsense_context.ptrWdConfig[wd_index].numSns);
    }
    return buffer_index;
}
#endif

#if LLS_FACTORY_CALIBRATION_ENABLE
/*******************************************************************************
 * Function Name: liquid_level_OneTime_Calibration
 ********************************************************************************
 * Summary:
 * Verifies and performs the one time factory auto calibration status of the liquid level widgets
 *
 *******************************************************************************/
static void liquid_level_OneTime_Calibration(void)
{
    uint8_t *ptr_eeprom_data;
    uint32_t wd_id = 0u;
    uint8_t calib_status = 0u;

