Infineon/mtb-example-psoc4-msclp-lls/main.c
    /* Read the factory calibrated values from EEPROM*/
    Cy_Em_EEPROM_Read(LOGICAL_EM_EEPROM_START, eeprom_data,
            LOGICAL_EM_EEPROM_SIZE, &em_eeprom_context);

    for (wd_id = 0u; wd_id < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wd_id++)
    {
        /* Apply one time calibration only to Liquid level widgets */
        if ((uint8_t) cy_capsense_context.ptrWdConfig[wd_id].wdType == CY_CAPSENSE_WD_LIQUID_LEVEL_E ||
                (uint8_t) cy_capsense_context.ptrWdConfig[wd_id].wdType == CY_CAPSENSE_WD_LIQUID_PRESENCE_E)
        {
            /* Get the EEPROM pointer location of the widget*/
            ptr_eeprom_data = &eeprom_data[get_eeprom_buffer_position(wd_id)
                                           + POWERON_STATUS_SIZE];

            /* Verify the LLS CDAC calibration and level calibration completion*/
            if (Cy_CapSense_IsLlwCalibrationValid(wd_id, &cy_capsense_context))
            {
                if (ptr_eeprom_data[EEPROM_STATE_OFFSET] == STATE_VALID)
                {
                    /* Set the status flag to ready state before writing into EEPROM.*/
                    Cy_CapSense_SetWidgetCalibrationState(wd_id,
                            STATE_VALID, &cy_capsense_context);

                    /* Update CDAC parameters with the factory calibrated values read from EEPROM */
                    Cy_CapSense_WriteWidgetCdacParam(
                            &ptr_eeprom_data[EEPROM_DATA_OFFSET], wd_id,
                            &cy_capsense_context);
                }
                else
                {
                    /* Call Cy_CapSense_Enable() only once and use the CDAC values of widgets to store in EEPROM */
                    if (calib_status == 0u)
                    {
                        /* Initialize the CAPSENSE firmware modules. */
                        Cy_CapSense_Enable(&cy_capsense_context);
                        calib_status = 1;
                    }
                    /* Reads the calibrated values from context to eeprom buffer*/
                    Cy_CapSense_ReadWidgetCdacParam(
                            &ptr_eeprom_data[EEPROM_DATA_OFFSET], wd_id,
                            &cy_capsense_context);

                    /* Set the status flag to valid before writing into EEPROM*/
                    ptr_eeprom_data[EEPROM_STATE_OFFSET] = STATE_VALID;

                    /* Update the local calibration status flag */
                    Cy_CapSense_SetWidgetCalibrationState(wd_id,
                            STATE_VALID, &cy_capsense_context);

                    /* Write the factory calibrated values to EEPROM*/
                    Cy_Em_EEPROM_Write(LOGICAL_EM_EEPROM_START, eeprom_data,
                            LOGICAL_EM_EEPROM_SIZE, &em_eeprom_context);
                }
            }
        }
        else
        {
            /* Update the local calibration status flag to avoid auto calibration of LLS widget */
            Cy_CapSense_SetWidgetCalibrationState(wd_id,
                    STATE_VALID, &cy_capsense_context);
        }
    }
}
#endif

/*******************************************************************************
 * Function Name: led_control
 ********************************************************************************
 * Summary:
 * Control LED2 and LED3 in the kit to show the Tank removal detection and Liquid presence/absence
 *******************************************************************************/
void led_control()
{
    uint32_t tank_status;

#if (CY_CAPSENSE_LIQUID_LEVEL_TANK_REMOVAL_DETECTION_EN)
    tank_status = Cy_CapSense_IsTankRemoved(CY_CAPSENSE_LIQUIDLEVEL0_WDGT_ID, &cy_capsense_context);
    if (tank_status==1)
        Cy_GPIO_Write(CYBSP_USER_LED2_PORT, CYBSP_USER_LED2_NUM, CYBSP_LED_ON);
    else
        Cy_GPIO_Write(CYBSP_USER_LED2_PORT, CYBSP_USER_LED2_NUM, CYBSP_LED_OFF);
#endif

#if (CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN)

/* Static variable to track the previous level (must be static to persist across function calls) */
static uint8_t prev_liquid_level = 0xFF; 

/* Get the current liquid level */
uint8_t current_liquid_level = Cy_CapSense_GetLiquidPresenceLevel(CY_CAPSENSE_LIQUIDLEVEL0_WDGT_ID, &cy_capsense_context);

/* Only update LED configuration if the level has actually changed */
if (current_liquid_level != prev_liquid_level)
{
    prev_liquid_level = current_liquid_level;

    switch (current_liquid_level)
    {
        case 1:
            /* Level 1: Blink at Rate 1 (Slow) */
            Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_HW, CYBSP_PWM_MASK);
            Cy_TCPWM_PWM_SetPeriod0(CYBSP_PWM_HW, CYBSP_PWM_NUM, LEVEL_1_BLINK_PERIOD);
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_HW, CYBSP_PWM_NUM, LEVEL_1_DUTY_CYCLE);
            break;

        case 2:
            /* Level 2: Blink at Rate 2 (Medium) */
            Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_HW, CYBSP_PWM_MASK);
            Cy_TCPWM_PWM_SetPeriod0(CYBSP_PWM_HW, CYBSP_PWM_NUM, LEVEL_2_BLINK_PERIOD);
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_HW, CYBSP_PWM_NUM, LEVEL_2_DUTY_CYCLE);
            break;

        case 3:
            /* Level 3: Blink at Rate 3 (Fast) */
            Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_HW, CYBSP_PWM_MASK);
            Cy_TCPWM_PWM_SetPeriod0(CYBSP_PWM_HW, CYBSP_PWM_NUM, LEVEL_3_BLINK_PERIOD);
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_HW, CYBSP_PWM_NUM, LEVEL_3_DUTY_CYCLE);
            break;

        case 0:
            /* Level None: Turn LED OFF */
            Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_HW, CYBSP_PWM_MASK);
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_HW, CYBSP_PWM_NUM, 0);

            break;

        default:
            Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_HW, CYBSP_PWM_MASK);
            Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_HW, CYBSP_PWM_NUM, 0);
            break;
}

}
#endif
}
/* [] END OF FILE */
